Revit 2027 API
BuiltInFailures.StairRampFailures.CannotPlaceBalusterOffset Property
 Can't place Balusters and/or Rails with desired offset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceBalusterOffset { get; }
Public Shared ReadOnly Property CannotPlaceBalusterOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceBalusterOffset {
	FailureDefinitionId^ get ();
}
static member CannotPlaceBalusterOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace